\c factory_db;

INSERT INTO public.categories (name, parent_id) VALUES
    ('Мебель', NULL),            --1
    ('Мебель для спальни', 1),   --2
    ('Кровати спальные', 2),     --3
    ('Столики прикроватные', 2), --4
    ('Мебель для гостинной', 1), --5
    ('Столы журнальные', 5),     --6
    ('Шкафы сервантные', 5),     --7
    ('Мебель для кухни', 1),     --8
    ('Стулья барные',8),        --9
    ('Столы обеденные', 8);      --10

INSERT INTO public.products (name, category_id, price) VALUES
    ('Кровать "Королевская"', 3, 3200.00),  --1
    ('Кровать "Славянка"', 3, 2200.00),     --2
    ('Стол "Пиршество"', 10, 1400.00),      --3
    ('Столик "Две тумбы плюс"', 4, 400.00), --4
    ('Шкаф "Стеклянный куб"', 7, 2000.00);  --5

INSERT INTO public.materials (name, supplier_name) VALUES
    ('Дерево - берёза', 'ЧУП "Лесогрызы"'),            --1
    ('Дерево - дуб', 'ЧУП "Лесогрызы"'),               --2
    ('Стекло акриловое', 'ОАО "Стеклозавод "Неман""'), --3
    ('ДВП', 'ОАО "СтоМатериаловПлюс"'),                --4
    ('ДСП', 'ОАО "СтоМатериаловПлюс"'),                --5
    ('Золото', 'ОАО "БелЮвелирТорг"'),                 --6
    ('Кожа натуральная', 'ЧУП "Дикий охотник"'),       --7
    ('Текстиль', 'ООО "Минская Текстильная Фабрика"'); --8

INSERT INTO public.product_materials (product_sku, material_sku) VALUES
    (1, 2),
    (1, 4),
    (1, 6),
    (1, 8),
    (1, 7),
    (2, 1),
    (2, 4),
    (2, 8),
    (3, 4),
    (3, 5),
    (4, 4),
    (4, 5),
    (5, 3),
    (5, 5);

INSERT INTO public.clients (phone_number, organization_name, email, legal_address) VALUES
    ('375291111111', 'ОАО "АМИ Мебель"', 'ami@gmail.com', 'г. Дзержинск, ул. Ленина 12'),
    ('375331223445', 'ООО "АйТи Решения"', 'itsolutions@gmail.com', 'г. Минск, ул. Интернациональная 14, о. 4'),
    ('375441114444', 'ГУО "СШ 15 г. Минска"', 'shool15minsk@mail.ru', 'г. Минск, ул. Калинина 52');

INSERT INTO public.product_orders (client_phone_number, product_sku, quantity) VALUES
    ('375291111111', 1, 2),
    ('375291111111', 2, 10),
    ('375291111111', 3, 10),
    ('375291111111', 4, 4),
    ('375331223445', 5, 10),
    ('375331223445', 3, 3),
    ('375331223445', 5, 10);